# CI/CD

## CI/CD ?
CI (Continual Integretion): 지속적 통합, 개발자들은 하루에 수십 번 이상 코드를 공유 및 저장소에 저장하고 통합하는데, 자동으로 빌드 및 테스트를 진행하는 프로세스  
CD (Continual Deployment): 지속적 배포, 테스트를 통과한 코드를 배포 직전까지 준비  

소프트웨어 개발의 자동화된 파이프라인을 구축하여 더 빠르고 안정적으로 제품을 배포할 수 있게 해주는 DevOps 개념

## 사용 이유
1. 코드 품질 향상
- 자동 테스트로 버그를 조기에 발견할 수 있음  
- 모든 커밋마다 빌드와 테스트가 돌아가서 문제 생긴 시점을 빠르게 추적 가능

2. 배포 자동화

- 사람 손이 가지 않으므로 실수 줄이기
- 버튼 한 번으로 프로덕션에 배포 가능 (또는 커밋만으로 자동 배포)

3. 개발 속도 향상

- 배포 주기가 짧아져서 빠른 피드백과 빠른 기능 릴리즈 가능
- 새 기능이나 버그 픽스를 빠르게 유저에게 전달

4. 협업 효율성 증가

- 여러 명이 동시에 작업해도 충돌을 자동으로 탐지하고 방지
- 병합 전에 자동 테스트로 문제 발생 여부 확인 가능

5. 신뢰성 향상

- 코드가 자동으로 테스트되고 배포되므로 사람이 놓칠 수 있는 실수를 줄일 수 있음
- 롤백도 쉽게 가능 (ex: 배포 실패 시 이전 버전으로 자동 복구)
